AccumulationRegisters/Планирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Планирование</Name>
			<Comment>Регистр накопления Планирование</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказательПлана1</Name>
					<Comment>Показатель плана 1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательПлана2</Name>
					<Comment>Показатель плана 2</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательПлана3</Name>
					<Comment>Показатель плана 3</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательФакта1</Name>
					<Comment>Показатель факта 1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательФакта2</Name>
					<Comment>Показатель факта 2</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательФакта3</Name>
					<Comment>Показатель факта 3</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Comment>Вид плана</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАналитикиПланирования1</Name>
					<Comment>Вид аналитики планирования 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАналитикиПланирования2</Name>
					<Comment>Вид аналитики планирования 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПланФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПланФакт</Name>
			<Comment>План / факт</Comment>
			<BasedOn>
				<xr:Item>Document.ПланФакт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.Планирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Comment>Вид плана</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектПланирования</Name>
					<Comment>Объект планирования</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланФакт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитикиПланирования1</Name>
							<Comment>Вид аналитики планирования 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитикиПланирования2</Name>
							<Comment>Вид аналитики планирования 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана1</Name>
							<Comment>Показатель плана 1</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана2</Name>
							<Comment>Показатель плана 2</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана3</Name>
							<Comment>Показатель плана 3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПлана</Name>
					<Comment>Параметры плана</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Планирование/Ext/RecordSetModule.bsl
// Модуль набора записей регистра накоплений "Планирование"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем Дата Экспорт, 
ДокументОбъект Экспорт, 
ВидПлана Экспорт, 
ДатаНачала Экспорт, 
ДатаКонца Экспорт,
ПодразделениеКомпании Экспорт;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проведение по регистрам документа с видом операции "План"
Процедура План() Экспорт
	ТЧПоказатели=ПолучитьТаблицуПоказатели();
	
	Для Каждого Показатель Из ТЧПоказатели Цикл
		НовоеДвижение=Добавить();
		
		// Стандартные атрибуты
		НовоеДвижение.Период=Дата;
		НовоеДвижение.Регистратор=ДокументОбъект;
		
		// Атрибуты шапки
		НовоеДвижение.ВидПлана=ВидПлана;
		НовоеДвижение.ДатаНачала=ДатаНачала;
		НовоеДвижение.ДатаКонца=ДатаКонца;
		НовоеДвижение.ПодразделениеКомпании=ПодразделениеКомпании;
		
		// Атрибуты ТЧ "Показатели"
		НовоеДвижение.ВидАналитикиПланирования1=Показатель.ВидАналитикиПланирования1;
		НовоеДвижение.ВидАналитикиПланирования2=Показатель.ВидАналитикиПланирования2;
		НовоеДвижение.ПоказательПлана1=Показатель.ПланФакт1;
		НовоеДвижение.ПоказательПлана2=Показатель.ПланФакт2;
		НовоеДвижение.ПоказательПлана3=Показатель.ПланФакт3;
	КонецЦикла;
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
КонецПроцедуры

// Проведение по регистрам документа с видом операции "Факт"
Процедура Факт() Экспорт
	
	ТЧПоказатели=ПолучитьТаблицуПоказатели();
	
	Для Каждого Показатель Из ТЧПоказатели Цикл
		НовоеДвижение=Добавить();
		
		// Стандартные атрибуты
		НовоеДвижение.Период=Дата;
		НовоеДвижение.Регистратор=ДокументОбъект;
		
		// Атрибуты шапки
		НовоеДвижение.ВидПлана=ВидПлана;
		НовоеДвижение.ДатаНачала=ДатаНачала;
		НовоеДвижение.ДатаКонца=ДатаКонца;
		НовоеДвижение.ПодразделениеКомпании=ПодразделениеКомпании;
		
		// Атрибуты ТЧ "Показатели"
		НовоеДвижение.ВидАналитикиПланирования1=Показатель.ВидАналитикиПланирования1;
		НовоеДвижение.ВидАналитикиПланирования2=Показатель.ВидАналитикиПланирования2;
		НовоеДвижение.ПоказательФакта1=Показатель.ПланФакт1;
		НовоеДвижение.ПоказательФакта2=Показатель.ПланФакт2;
		НовоеДвижение.ПоказательФакта3=Показатель.ПланФакт3;
	КонецЦикла;
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает результат запроса по ТЧ "Показатели"
Функция ПолучитьТаблицуПоказатели()
	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ДокументПоказатели.ВидАналитикиПланирования1 КАК ВидАналитикиПланирования1,
	|	ДокументПоказатели.ВидАналитикиПланирования2 КАК ВидАналитикиПланирования2,
	|	ДокументПоказатели.ПоказательПлана1 КАК ПланФакт1,
	|	ДокументПоказатели.ПоказательПлана2 КАК ПланФакт2,
	|	ДокументПоказатели.ПоказательПлана3 КАК ПланФакт3				
	|ИЗ
	|	Документ.ПланФакт.Показатели КАК ДокументПоказатели
	|ГДЕ
	|	ДокументПоказатели.Ссылка=&Ссылка	
	|";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
	Запрос.Текст=ТекстЗапроса;
	Возврат Запрос.Выполнить().Выгрузить();		
КонецФункции

#КонецОбласти

#КонецЕсли
